# COSC 3337 Lab 02 Minh Nguyen

## Intro to pandas

In [1]:
import pandas as pd
import numpy as np

## Series

Create a Series

In [2]:
# Create Series with some same index values
my_series = pd.Series(data=[1, 2, 3, 4], index=['A', 'B', 'C', 'A'])
print(my_series)
print(type(my_series))

A    1
B    2
C    3
A    4
dtype: int64
<class 'pandas.core.series.Series'>

Access element

In [3]:
print(f'Accessing first element using my_series[1]: {my_series[1]}')
print(f"Accessing first element using my_series['B']: {my_series['B']}")

Accessing first element using my_series[1]: 2
Accessing first element using my_series['B']: 2

Pass dict to Series:

In [4]:
my_series = pd.Series(data={'a': 1, 'b': 2, 'c': 3, 'd': 4})
print(my_series)
print(f'Type of my_series: {type(my_series)}')

a    1
b    2
c    3
d    4
dtype: int64
Type of my_series: <class 'pandas.core.series.Series'>

Pass array to Series

In [5]:
my_series = pd.Series(data=np.array([3,2,1]), index=['A', 2, [3,4]])
print(my_series)
print(f'Type of my_series: {type(my_series)}')

A         3
2         2
[3, 4]    1
dtype: int64
Type of my_series: <class 'pandas.core.series.Series'>

Index labels not specified

In [6]:
my_series = pd.Series(pd.Series(data=np.arange(1,6)))
print(my_series)
print(type(my_series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

Perform operations on Series

In [7]:
week_one = pd.Series(data=[6000, 800, 10], index=['Iron Man', 'Captain', 'Spider Man'])
print(f'- Week one: \n{week_one}')
week_two = pd.Series(data=[5000, 1000, 5], index=['Iron Man', 'Captain', 'Spider Man'])
print(f'- Week two: \n{week_two}')
total_earn = week_one + week_two
print(f'- Total earn: \n{total_earn}')

- Week one:
Iron Man      6000
Captain        800
Spider Man      10
dtype: int64
- Week two:
Iron Man      5000
Captain       1000
Spider Man       5
dtype: int64
- Total earn:
Iron Man      11000
Captain        1800
Spider Man       15
dtype: int64

## DataFrames

Create a DataFrame

In [8]:
my_df = pd.DataFrame(data=np.arange(5,30).reshape(5,5), index=['A', 'B', 'C', 'D', 'E'],
                     columns=['col1', 'col2', 'col3', 'col4', 'col5'])
print(type(my_df))
my_df

<class 'pandas.core.frame.DataFrame'>

   col1  col2  col3  col4  col5
A     5     6     7     8     9
B    10    11    12    13    14
C    15    16    17    18    19
D    20    21    22    23    24
E    25    26    27    28    29

Access element

In [9]:
print(f"- my_df['col3']: \n{my_df['col3']}")
print(type(my_df['col3']))

- my_df['col3']:
A     7
B    12
C    17
D    22
E    27
Name: col3, dtype: int64
<class 'pandas.core.series.Series'>

Index labels not specified

In [10]:
my_df = pd.DataFrame(data=np.arange(5,30).reshape(5,5), 
                     columns=['col1', 'col2', 'col3', 'col4', 'col5'])
my_df

   col1  col2  col3  col4  col5
0     5     6     7     8     9
1    10    11    12    13    14
2    15    16    17    18    19
3    20    21    22    23    24
4    25    26    27    28    29

Selection

In [11]:
my_df = pd.DataFrame(data=np.arange(10,210,10).reshape(4,5), index=['A', 'B', 'C', 'D'],
                     columns=['col1', 'col2', 'col3', 'col4', 'col5'])
my_df

   col1  col2  col3  col4  col5
A    10    20    30    40    50
B    60    70    80    90   100
C   110   120   130   140   150
D   160   170   180   190   200

In [12]:
# Access elements
my_df[['col1', 'col3', 'col5']]

   col1  col3  col5
A    10    30    50
B    60    80   100
C   110   130   150
D   160   180   200

In [13]:
# Access row data using .iloc (index location)
my_df.iloc[[3]]

   col1  col2  col3  col4  col5
D   160   170   180   190   200

In [14]:
# Access row data using .loc (index name/label)
my_df.loc[['A']]

   col1  col2  col3  col4  col5
A    10    20    30    40    50

Grab a section

In [15]:
my_df.iloc[0:4]

   col1  col2  col3  col4  col5
A    10    20    30    40    50
B    60    70    80    90   100
C   110   120   130   140   150
D   160   170   180   190   200

In [16]:
my_df.loc['B':'D']

   col1  col2  col3  col4  col5
B    60    70    80    90   100
C   110   120   130   140   150
D   160   170   180   190   200

In [17]:
# Grab a section of both rows and columns
my_df.iloc[1:3, 0:4]

   col1  col2  col3  col4
B    60    70    80    90
C   110   120   130   140

In [18]:
my_df.loc['B':'C', 'col1':'col3']

   col1  col2  col3
B    60    70    80
C   110   120   130

In [19]:
# Grab elements based on some conditions
my_df = pd.DataFrame(data=np.arange(10,210, 10).reshape(4,5), index=['A', 'B', 'C', 'D'],
                     columns=['col1', 'col2', 'col3', 'col4', 'col5'])
my_df
my_df % 3 == 0

    col1   col2   col3   col4   col5
A  False  False   True  False  False
B   True  False  False   True  False
C  False   True  False  False   True
D  False  False   True  False  False

In [20]:
my_df[my_df % 3 == 0]

   col1   col2   col3  col4   col5
A   NaN    NaN   30.0   NaN    NaN
B  60.0    NaN    NaN  90.0    NaN
C   NaN  120.0    NaN   NaN  150.0
D   NaN    NaN  180.0   NaN    NaN

In [21]:
# filling all NaN values with 0
my_df[my_df % 3 == 0].fillna(value='Invalid')

      col1     col2     col3     col4     col5
A  Invalid  Invalid     30.0  Invalid  Invalid
B     60.0  Invalid  Invalid     90.0  Invalid
C  Invalid    120.0  Invalid  Invalid    150.0
D  Invalid  Invalid    180.0  Invalid  Invalid

In [22]:
# filling all NaN values with whatever the mean of my_df's original col5
my_df[my_df % 3 == 0].fillna(value=my_df['col5'].mean())

    col1   col2   col3   col4   col5
A  125.0  125.0   30.0  125.0  125.0
B   60.0  125.0  125.0   90.0  125.0
C  125.0  120.0  125.0  125.0  150.0
D  125.0  125.0  180.0  125.0  125.0

Adding and Dropping Columns

In [23]:
my_df

   col1  col2  col3  col4  col5
A    10    20    30    40    50
B    60    70    80    90   100
C   110   120   130   140   150
D   160   170   180   190   200

In [24]:
# Adding Columns
my_df['new_col6'] = [1, 2, 3, 4]
my_df

   col1  col2  col3  col4  col5  new_col6
A    10    20    30    40    50         1
B    60    70    80    90   100         2
C   110   120   130   140   150         3
D   160   170   180   190   200         4

In [25]:
my_df['col5 - col2'] = my_df['col5'] - my_df['col2']
my_df

   col1  col2  col3  col4  col5  new_col6  col5 - col2
A    10    20    30    40    50         1           30
B    60    70    80    90   100         2           30
C   110   120   130   140   150         3           30
D   160   170   180   190   200         4           30

In [26]:
# Dropping Columns
my_df.drop(columns=['new_col6']) # Not permanent

   col1  col2  col3  col4  col5  col5 - col2
A    10    20    30    40    50           30
B    60    70    80    90   100           30
C   110   120   130   140   150           30
D   160   170   180   190   200           30

In [27]:
my_df.drop(columns=['new_col6'], inplace=True) # Permanent
my_df

   col1  col2  col3  col4  col5  col5 - col2
A    10    20    30    40    50           30
B    60    70    80    90   100           30
C   110   120   130   140   150           30
D   160   170   180   190   200           30

Groupby and Common Operations

In [28]:
my_df = pd.DataFrame({'Type': ['Falcon', 'Falcon', 'Parrot', 'Parrot', 'Cat', 'Cat', 'Cat'],
                      'Max Speed': [380., 370., 24., 26., 50., 50., 150.]})
my_df

     Type  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0
4     Cat       50.0
5     Cat       50.0
6     Cat      150.0

In [29]:
# Unique values
print(f"Unique types: {my_df['Type'].unique()}")
print(f"Unique max speeds: {my_df['Max Speed'].unique()}")

Unique types: ['Falcon' 'Parrot' 'Cat']
Unique max speeds: [380. 370.  24.  26.  50. 150.]

In [30]:
# Count the number of each unique element
print(f"- Count type: \n{my_df['Type'].value_counts()}")
print(f"Sum of Max Speed col: {my_df['Max Speed'].sum()}")
print(f"Mean of Max Speed col: {my_df['Max Speed'].mean()}")
print(f"Min from Max Speed col: {my_df['Max Speed'].min()}")
print(f"Max from Max Speed col: {my_df['Max Speed'].max()}")

- Count type:
Cat       3
Falcon    2
Parrot    2
Name: Type, dtype: int64
Sum of Max Speed col: 1050.0
Mean of Max Speed col: 150.0
Min from Max Speed col: 24.0
Max from Max Speed col: 380.0

In [31]:
# This grouped all cats together, all falcons together, all parrots together and then applied the mean function
# to each groups columns (only Max Speed in this case)
my_df.groupby(by='Type').mean()
# my_df.groupby(by='Max Speed').sum()

         Max Speed
Type
Cat      83.333333
Falcon  375.000000
Parrot   25.000000

## Extra Practice

Read given csv file

In [32]:
pokemon_df = pd.read_csv(filepath_or_buffer='Pokemon.csv')

Preview a few from dataset

In [33]:
pokemon_df.head(10)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
5,5,Charmeleon,Fire,NaN,405,58,64,58,80,65,80,1,False
6,6,Charizard,Fire,Flying,534,78,84,78,109,85,100,1,False
7,6,CharizardMega Charizard X,Fire,Dragon,634,78,130,111,130,85,100,1,False
8,6,CharizardMega Charizard Y,Fire,Flying,634,78,104,78,159,115,100,1,False
9,7,Squirtle,Water,NaN,314,44,48,65,50,64,43,1,False

Concise summary

In [34]:
pokemon_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   #           800 non-null    int64
 1   Name        800 non-null    object
 2   Type 1      800 non-null    object
 3   Type 2      414 non-null    object
 4   Total       800 non-null    int64
 5   HP          800 non-null    int64
 6   Attack      800 non-null    int64
 7   Defense     800 non-null    int64
 8   Sp. Atk     800 non-null    int64
 9   Sp. Def     800 non-null    int64
 10  Speed       800 non-null    int64
 11  Generation  800 non-null    int64
 12  Legendary   800 non-null    bool
dtypes: bool(1), int64(9), object(3)
memory usage: 75.9+ KB

Handle missing data

In [35]:
pokemon_df['Type 2'].fillna(pokemon_df['Type 1'], inplace=True)
pokemon_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   #           800 non-null    int64
 1   Name        800 non-null    object
 2   Type 1      800 non-null    object
 3   Type 2      800 non-null    object
 4   Total       800 non-null    int64
 5   HP          800 non-null    int64
 6   Attack      800 non-null    int64
 7   Defense     800 non-null    int64
 8   Sp. Atk     800 non-null    int64
 9   Sp. Def     800 non-null    int64
 10  Speed       800 non-null    int64
 11  Generation  800 non-null    int64
 12  Legendary   800 non-null    bool
dtypes: bool(1), int64(9), object(3)
memory usage: 75.9+ KB

Select observations based on conditions

In [36]:
# pokemon_df[pokemon_df['Legendary'] == True]
pokemon_df[pokemon_df['Legendary'] == False]

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,Fire,309,39,52,43,60,50,65,1,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
787,711,GourgeistSuper Size,Ghost,Grass,494,85,100,122,58,75,54,6,False
788,712,Bergmite,Ice,Ice,304,55,69,85,32,35,28,6,False
789,713,Avalugg,Ice,Ice,514,95,117,184,44,46,28,6,False
790,714,Noibat,Flying,Dragon,245,40,30,35,45,40,55,6,False
791,715,Noivern,Flying,Dragon,535,85,70,80,97,80,123,6,False

Shape of DataFrame

In [37]:
print('Legendary True:', pokemon_df[pokemon_df['Legendary'] == True].shape)
print('Legendary False:', pokemon_df[pokemon_df['Legendary'] == False].shape)
print('Type 1 Flying:', pokemon_df[pokemon_df['Type 1'] == 'Flying'].shape)

Legendary True: (65, 13)
Legendary False: (735, 13)
Type 1 Flying: (4, 13)

Index location of the max value in the column of interest

In [38]:
print('Index of max HP pokemon:',pokemon_df['HP'].idxmax())
pokemon_df.iloc[pokemon_df['HP'].idxmax()]

Index of max HP pokemon: 261

#                 242
Name          Blissey
Type 1         Normal
Type 2         Normal
Total             540
HP                255
Attack             10
Defense            10
Sp. Atk            75
Sp. Def           135
Speed              55
Generation          2
Legendary       False
Name: 261, dtype: object

In [39]:
pokemon_df.sort_values(by='HP',ascending=False).head(1)

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
261,242,Blissey,Normal,Normal,540,255,10,10,75,135,55,2,False

Number of each unique pokemon (based on Type)

In [40]:
print('Type 1:', pokemon_df['Type 1'].value_counts())
print('Type 2:', pokemon_df['Type 2'].value_counts())

Type 1: Water       112
Normal       98
Grass        70
Bug          69
Psychic      57
Fire         52
Electric     44
Rock         44
Dragon       32
Ground       32
Ghost        32
Dark         31
Poison       28
Steel        27
Fighting     27
Ice          24
Fairy        17
Flying        4
Name: Type 1, dtype: int64
Type 2: Flying      99
Water       73
Psychic     71
Normal      65
Grass       58
Poison      49
Ground      48
Fighting    46
Fire        40
Fairy       38
Electric    33
Dark        30
Dragon      29
Steel       27
Ice         27
Ghost       24
Rock        23
Bug         20
Name: Type 2, dtype: int64

Mean HP for each type groups

In [41]:
pokemon_df.groupby(by='Type 2').mean()['HP']

Type 2
Bug         53.100000
Dark        70.533333
Dragon      74.448276
Electric    65.121212
Fairy       68.394737
Fighting    75.847826
Fire        65.275000
Flying      71.545455
Ghost       55.041667
Grass       63.637931
Ground      73.833333
Ice         79.370370
Normal      80.015385
Poison      60.979592
Psychic     72.394366
Rock        67.695652
Steel       64.148148
Water       66.054795
Name: HP, dtype: float64